//1. Подумать над структурой класса Ноутбук для магазина техники — выделить поля и методы. Реализовать в Java.
//2. Создать множество ноутбуков.
//    - Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки, отвечающие фильтру. Критерии фильтрации можно хранить в Map. Например:
//        “Введите цифру, соответствующую необходимому критерию:
//        1 - бренд
//        2 -цвет
//    - Далее нужно запросить минимальные значения для указанных критериев — сохранить параметры фильтрации можно также в Map.
//    - Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям.

package lesson06;

public class Main {
}
